In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4, 5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df.loc[3, "a"]

6

In [5]:
df.loc[[1, 2], ["a", "b"]]

   a  b
1  4  7
2  5  8

In [6]:
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index = [1, 2, 3],
        columns = ["a", "b", "c"])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df = pd.DataFrame(
{"a" : [4, 5, 6],
"b" : [7, 8, 9],
"c" : [10, 11, 12]},
index = pd.MultiIndex.from_tuples(
[('d', 1), ('d', 2), ('e', 2)],
names = ['n', 'v']))

df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [8]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [9]:
df.b > 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [10]:
df[df["c"] > 10]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [11]:
df[df["c"] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [12]:
df = pd.DataFrame(
{"a" : [4, 5, 6, 6],
"b" : [7, 8, 9, 9],
"c" : [10, 11, 12, 12]},
index = pd.MultiIndex.from_tuples(
[('d', 1), ('d', 2), ('e', 2), ('e', 3)],
names = ['n', 'v']))

df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [13]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [14]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [15]:
df.drop_duplicates(inplace = True)

In [16]:
df = df.drop_duplicates(keep = "last")
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [17]:
df.head()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [18]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [19]:
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [20]:
df.column.isin?

Object `df.column.isin` not found.

In [21]:
df.a.isin?

In [22]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [23]:
df.a.isin([5, 6])

n  v
d  1    False
   2     True
e  2     True
Name: a, dtype: bool

In [24]:
df["a"].isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [25]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [26]:
import numpy as np
df = pd.DataFrame(
{"a" : [4, 5, 6, 6, np.nan],
"b" : [7, 8, np.nan, 9, 9],
"c" : [10, 11, 12, np.nan, 12]},
index = pd.MultiIndex.from_tuples(
[('d', 1), ('d', 2), ('e', 1), ('e', 2), ('e', 3)],
names = ['n', 'v']))

df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [27]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 1  False   True  False
  2  False  False   True
  3   True  False  False

In [28]:
df['a'].isnull()

n  v
d  1    False
   2    False
e  1    False
   2    False
   3     True
Name: a, dtype: bool

In [29]:
df['a'].isnull().sum()

1

In [30]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 1   True  False   True
  2   True   True  False
  3  False   True   True

In [31]:
df.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 1   True  False   True
  2   True   True  False
  3  False   True   True

In [32]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [33]:
df.a.notnull()

n  v
d  1     True
   2     True
e  1     True
   2     True
   3    False
Name: a, dtype: bool

* &, |, ~, ^, df.any(), df.all()
* and, or, not, xor, any, all

In [34]:
df.all()

a    True
b    True
c    True
dtype: bool

In [35]:
df.any()

a    True
b    True
c    True
dtype: bool

In [36]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  1    False
   2    False
   3     True
Name: a, dtype: bool

In [37]:
df.a.notnull()

n  v
d  1     True
   2     True
e  1     True
   2     True
   3    False
Name: a, dtype: bool

In [38]:
1 and 2

2

In [39]:
True and False

False

In [40]:
False and False

False

In [41]:
df[df.b == 7] and df[df.a == 5]

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df[df.b == 7] & df[df.a == 5]

In [48]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [49]:
df.head(5)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [50]:
df.tail()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [51]:
df.tail(2)

       a    b     c
n v
e 2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [52]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [53]:
df.sample(frac = 0.5)

       a    b     c
n v
e 3  NaN  9.0  12.0
  1  6.0  NaN  12.0

In [65]:
df.sample(frac = 0.5)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 3  NaN  9.0  12.0

In [56]:
#  .
df.sample(frac = 0.7)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  9.0   NaN
  3  NaN  9.0  12.0
  1  6.0  NaN  12.0

In [67]:
# n =  (   .)
df.sample(n = 5)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  9.0   NaN
d 1  4.0  7.0  10.0
e 3  NaN  9.0  12.0
  1  6.0  NaN  12.0

In [68]:
#  ,  .
df.iloc[10:20]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [69]:
#       .
df.iloc[:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0

In [72]:
df.iloc[2:]

       a    b     c
n v
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [71]:
df.iloc[-2:]

       a    b     c
n v
e 2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [74]:
df.nlargest?

In [75]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
...                                   434000, 434000, 337000, 11300,
...                                   11300, 11300],
...               'GDP': [1937894, 2583560 , 12011, 4520, 12128,
...                            17036, 182, 38, 311],
...               'alpha-2': ["IT", "FR", "MT", "MV", "BN",
...                               "IS", "NR", "TV", "AI"]},
...                index=["Italy", "France", "Malta",
...                          "Maldives", "Brunei", "Iceland",
...                          "Nauru", "Tuvalu", "Anguilla"])

In [76]:
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [80]:
df.nlargest(3, "population")

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

In [81]:
df.nsmallest(2, "GDP")

        population  GDP alpha-2
Tuvalu       11300   38      TV
Nauru        11300  182      NR